<template>
  <v-container>
    <v-row :dense="$vuetify.display.xs">
      <v-col cols="12">
        <v-no-ssr>
          <page-breadcrumbs :breadcrumbs="breadcrumbs" />
        </v-no-ssr>
      </v-col>
      <v-col cols="12">
        <v-card variant="outlined">
          <v-card-title>
            <div class="title-header">
              <h1 class="font-weight-bold text-h5 text-sm-h4">
                {{ title }}
              </h1>
            </div>
          </v-card-title>
          <v-divider color="secondary" />
          <v-card-text>
            <h2>ユーザー利用規約</h2>
            <h3>1．本サイトについて</h3>
            <p>当社は、主にタトゥー・刺青スタジオの運営者及びアーティスト（以下、「スタジオ運営者」といいます）と、ユーザー（以下、「ユーザー」）の効率的なマッチングを行うためのプラットフォームとして、スタジオ・アーティスト情報を掲載しております。</p>
            <p>本サイトに掲載されている情報は、スタジオ運営者からの情報提供ならびにHP等で公開されている情報をもとに提供しております。掲載内容については、正確かつ最新であるように努めますが、情報の詳細・最新性などについて一切の保証をするものではありません。利用詳細や最新のスタジオ情報はスタジオ運営者のサイトに直接ご確認をお願いいたします。</p>
            <h3>2．本サイトの利用について</h3>
            <p>本サイトは、情報を提供するプラットフォームであり、スタジオ運営者とは異なります。スタジオ・アーティストへの質問や利用検討の際は、直接スタジオ運営者へご確認ください。なお、本サイトが提供する情報を利用して、ユーザーが撮影スタジオ等との間で契約を締結した場合であっても、当社はユーザーとスタジオ運営者間の契約には一切関与いたしません。</p>
            <h3>3．プライバシーポリシー</h3>
            <p>本サイトの登録にあたり、当社が取得したユーザー情報はプライバシーポリシーに則り管理するものとします。</p>
            <h3>4．著作権</h3>
            <p>本サイトにて提供されるスタジオ運営者の情報、画像などの著作権、商標権等の知的財産権はスタジオ運営者ならびにその許可を得て掲載している当社に帰属します。ユーザーは、当社の承諾なく著作権法で定めるユーザー個人の私的利用の範囲を超える使用（本サイトの全体又は一部を引用、複製し二次的著作物を作成する行為、無断で商業目的に転用する行為等）をしてはいけません。</p>
            <p>本規約に著しく反すると当社が判断した場合、当該ユーザーに対し、損害賠償請求等必要な措置を取らせていただきます。また、ユーザーは自己の責任において当該紛争を解決するとともに、当社に一切の損害を与えないものとします。</p>
            <h3>5．遵守事項</h3>
            <p>ユーザーは、本サイトを利用するにあたり、当社ならびにスタジオ運営者へ次の行為をしてはならないものとします。</p>
            <ul>
              <li>法令に違反するまたは違反に加担する恐れのある行為</li>
              <li>著作権、商標権その他知的財産権、名誉、プライバシー侵害</li>
              <li>社会規範・公序良俗に反するもの</li>
              <li>当社ならびにスタジオ運営者への妨害行為</li>
              <li>本サイトの情報等を無断で収集・転載・蓄積する行為</li>
              <li>暴⼒団等の反社会的勢力へサービスや利益を提供する行為</li>
              <li>その他、当社が不適切と判断する行為</li>
            </ul>
            <p>本規約に著しく反すると当社が判断した場合、当該ユーザーに対し、損害賠償請求等必要な措置を取らせていただきます。</p>
            <h3>6．免責事項</h3>
            <p>当社はユーザーとスタジオ運営者間で行われる契約に一切関与しないとともに、以下の免責事項についても賠償責任を負いません。</p>
            <ul>
              <li>ユーザーとスタジオ運営者との間でおこったトラブル・紛争等</li>
              <li>
                当社がスタジオ運営者の情報提供をもとに掲載した情報でユーザーに損害が生じた場合
                <br>（スタジオの金額、在籍アーティストなどの情報は変動しますので、ご利用前にスタジオ運営者へご確認ください）
              </li>
              <li>通信障害等によるシステム遅延・データの消失</li>
              <li>当社が意図せぬ不正アクセスやウィルスなどによりユーザーに損害が生じた場合</li>
              <li>自然災害や感染症などの社会的な非常事態により発生する情報提供の遅延等</li>
            </ul>
            <p>また、当社は本サイトのユーザビリティ向上の為、システムの更新に努めることとし、以下に該当する場合には事前にユーザーへ通知することなく、本サイトを休止または停止することがございます。</p>
            <ol>
              <li>本サイトの保守または仕様の変更を伴う場合</li>
              <li>自然災害などの非常事態等が発生した場合</li>
              <li>その他やむを得ない事由により当社が本サイトを休止又は停止すると判断した場合</li>
            </ol>
            <h3>7．準拠法および合意管轄裁判所</h3>
            <p>本規約の準拠法は日本法とし、本規約に関して紛争が生じた場合、当社本店所在地を管轄する地方裁判所を第一審の専属的合意管轄裁判所とします。</p>
            <h3>8．協議解決</h3>
            <p>本規約に定めのない事項は、当社とユーザーとの間で誠意をもって協議の上、対応するものとします。</p>
          </v-card-text>
          <v-divider />
          <v-card-text>
            <h2>スタジオ運営者利用規約</h2>
            <h3>1．本サイトについて</h3>
            <p>当社は、アーティスト・タトゥースタジオの運営者（以下、「スタジオ運営者」といいます）と、ユーザー（以下、「ユーザー」）の効率的なマッチングを行うためのプラットフォームとして、スタジオ情報を掲載しております。</p>
            <p>掲載している情報は、スタジオ運営者から提供を受けたまたはHP等で公開されている情報をもとに提供しております。</p>
            <h3>2．本サイトの利用について</h3>
            <p>本サイトは、アーティスト・スタジオを探すユーザーへ効率的な情報提供を行えるプラットフォームとして運営をしており、予約・キャンセル等を行う機能はございません。スタジオ運営者は自己の責任において直接ユーザーと連絡を取り合い、契約を行ってください。なお、本サイトを通じて契約に至った場合でも、ユーザーとスタジオ運営者の間の契約には一切関与いたしません。</p>
            <h3>3．本サイトへの掲載について</h3>
            <p>本サイトへの掲載には弊社基準の審査がございます。（弊社基準は非公開）</p>
            <p>審査の結果、掲載をお断りさせていただくこともございますので予めご了承ください。</p>
            <p>また、一度掲載を行った後でも、予告なく掲載を取り消す場合もございますので、合せてご了承ください。</p>
            <h3>4．プライバシーポリシー</h3>
            <p>本サイトの登録にあたり、当社が取得したスタジオ運営者の情報はプライバシーポリシーに則り管理するものとします。</p>
            <h3>5．著作権</h3>
            <p>本サイトにて提供されるスタジオ運営者の情報、画像などの著作権、商標権等の知的財産権はスタジオ運営者ならびにその許可を得て掲載している当社に帰属します。スタジオ運営者は、当社に提供した画像などの情報に関する全ての著作権者であることを保証し、契約期間中は本サイトへの掲載や当社の営業目的の利用について、情報の提供を許諾したものとします。</p>
            <h3>6．遵守事項</h3>
            <p>スタジオ運営者は、本サイトを利用するにあたり、次の行為をしてはならないものとします。</p>
            <ul>
              <li>法令に違反するまたは違反に加担する恐れのある行為</li>
              <li>著作権、商標権その他知的財産権、名誉、プライバシー侵害</li>
              <li>社会規範・公序良俗に反するもの</li>
              <li>当社ならびにスタジオ運営者への妨害行為</li>
              <li>本サイトの情報等を無断で収集・転載・蓄積する行為</li>
              <li>ユーザーが開示した情報を不当に第三者へ開示・漏洩する行為</li>
              <li>暴⼒団等の反社会的勢力へサービスや利益を提供する行為</li>
              <li>その他、当社が不適切と判断する行為</li>
            </ul>
            <p>本規約に著しく反すると当社が判断した場合、スタジオ運営者に対し、損害賠償請求等必要な措置を取らせていただきます。</p>
            <h3>7．免責事項</h3>
            <p>当社はユーザーとスタジオ運営者間で行われる契約に一切関与しないとともに、以下の免責事項についても賠償責任を負いません。</p>
            <ol>
              <li>ユーザーとスタジオ運営者との間でおこったトラブル・紛争等</li>
              <li>当社がスタジオ運営者の情報提供をもとに掲載した情報でユーザーに損害が生じた場合<br>（掲載情報に重大な変更が生じた場合は速やかに当社へご連絡ください）</li>
              <li>通信障害等によるシステム遅延・データの消失</li>
              <li>当社が意図せぬ不正アクセスやウィルスなどによりスタジオ運営者に損害が生じた場合</li>
              <li>自然災害や感染症などの社会的な非常事態により発生する情報提供の遅延等</li>
              <li>本サイト掲載によるアクセス数増加や売上の保証</li>
              <li>掲載したスタジオの合法性や違法性の有無</li>
            </ol>
            <p>また、当社は本サイトのユーザビリティ向上の為、システムの更新に努めることとし、以下に該当する場合には事前にスタジオ運営者へ通知することなく、本サイトを休止または停止することがございます。</p>
            <ol>
              <li>本サイトの保守または仕様の変更を伴う場合</li>
              <li>自然災害などの非常事態等が発生した場合</li>
              <li>その他やむを得ない事由により当社が本サイトを休止又は停止すると判断した場合</li>
            </ol>
            <h3>8．準拠法および合意管轄裁判所</h3>
            <p>本規約の準拠法は日本法とし、本規約に関して紛争が生じた場合、当社本店所在地を管轄する地方裁判所を第一審の専属的合意管轄裁判所とします。</p>
            <h3>9．協議解決</h3>
            <p>本規約に定めのない事項は、当社とユーザーと間で誠意をもって協議の上、対応するものとします。</p>
          </v-card-text>
        </v-card>
      </v-col>
    </v-row>
  </v-container>
</template>

<script setup>
const title = '利用規約'
const breadcrumbs = computed(() => {
  return [
    {
      to: '/',
      text: 'TOP'
    },
    {
      disabled: true,
      to: '/about',
      text: title
    }
  ]
})
useHead({
  title
})
</script>

<style lang="scss" scoped>
.v-card--variant-outlined {
  border-color: #666666;
  border-width: 2px;
  border-radius: 8px;

  h1 {
    border-left: 1rem solid #aa3c34;
    padding-left: 1rem;
    line-height: 1.5;
  }
  h2 {
    border-left: 0.75rem solid #aa3c34;
    padding-left: 1.25rem;
    line-height: 1.75;
  }
  h3 {
    background: #f6f6f6;
    border-left: 0.5rem solid #aa3c34;
    padding-left: 1.5rem;
    line-height: 1.75;
    margin-top: 1rem;
    margin-bottom: 1rem;
  }
  a, p {
    margin-bottom: 0.5rem;
    padding-left: 2rem;
  }
  ul, ol {
    margin-bottom: 0.5rem;
    padding-left: 4rem;
  }
}
</style>
